/*
##### Задание 5. Кратность числа

###### Что нужно сделать
Напишите программу, которая проверяет, делится ли одно число на другое без остатка.

###### Пример 1

Введите первое число: 45 
Введите второе число: 5 
-----Проверяем----- 
Да, 45 делится на 5 без остатка!

###### Пример2

Введите первое число: 21 
Введите второе число: 8 
-----Проверяем----- 
Нет, 21 не делится на 8 без остатка!

###### Советы и рекомендации

Не забудьте про отрицательные числа.
Учитывайте правила деления чисел.

###### Что оценивается

Корректная работа программы.
*/

#include <iostream>
using namespace std;

int main() {
    cout << "Целочисленное деление (без остатка)\n";
    cout << "-----------------------------------\n";
    // Получение чисел для деления от пользователя
    int a, b;
    cout << "Введите первое число: ";
    cin >> a;
    cout << "Введите второе число: ";
    cin >> b;
    // Проверка деления на ноль
    while (b == 0) {
        cout << "На ноль делить нельзя.\n";
        cout << "Введите второе число: ";
        cin >> b;
    }
    cout << "-------------Вычисляем-------------\n";
    // Проверка делимости без остатка
    int remainder = a % b;
    if (remainder == 0) {
        cout << "Да, " << a << " делится на " << b << " без остатка!\n";
    } else {
        cout << "Нет, " << a << " не делится на " << b << " без остатка!\n";
        cout << "Остаток от деления: " << remainder;
    }
    return 0;
}